tap "cathyjf/misc" # https://github.com/cathyjf/homebrew-misc
tap "homebrew/core"
tap "powershell/tap"
tap "puppetlabs/puppet"
brew "aha"
brew "bash"
brew "ca-certificates"
brew "cathyjf/misc/git-remote-gcrypt-keybase"
brew "cathyjf/misc/oauth2-helper"
brew "coreutils"
brew "fish"
brew "ghostscript"
brew "git"
brew "gnupg"
brew "llvm"
brew "msmtp"
brew "nano"
brew "node"
brew "pass"
brew "perl"
brew "pinentry"
brew "poppler"
brew "powershell/tap/powershell"
brew "procmail"
brew "recode"
cask "macfuse"
cask "cathyjf/misc/keychain-interpose"
cask "cathyjf/misc/sshfs"
cask "puppetlabs/puppet/puppet-agent-8"
cask "virtualhereserver"